In [9]:
import pandas

data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions',
                 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}

In [10]:
football = pandas.DataFrame(data)
print (football)

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [11]:

football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [12]:
football.describe()

              year       wins     losses
count     8.000000   8.000000   8.000000
mean   2011.125000   9.375000   6.625000
std       0.834523   3.377975   3.377975
min    2010.000000   4.000000   1.000000
25%    2010.750000   7.500000   5.000000
50%    2011.000000  10.000000   6.000000
75%    2012.000000  11.000000   8.500000
max    2012.000000  15.000000  12.000000

In [13]:
football.dtypes

year       int64
team      object
wins       int64
losses     int64
dtype: object

In [14]:
football.head()

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5

In [15]:
football.tail()

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [16]:
football.sample(5)

   year     team  wins  losses
6  2011    Lions    10       6
4  2012  Packers    11       5
5  2010    Lions     6      10
1  2011    Bears     8       8
3  2011  Packers    15       1

In [17]:
football['year']

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [18]:
football.year

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [19]:
football[['year', 'team', 'wins']]

   year     team  wins
0  2010    Bears    11
1  2011    Bears     8
2  2012    Bears    10
3  2011  Packers    15
4  2012  Packers    11
5  2010    Lions     6
6  2011    Lions    10
7  2012    Lions     4

In [20]:
football[3:5]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5

In [24]:
football.iloc[3]

year         2011
team      Packers
wins           15
losses          1
Name: 3, dtype: object

In [28]:
import numpy as np
import pandas as pd

index = pd.date_range('1/1/2020', periods = 8)
df = pd.DataFrame(np.random.randn(8,3), index = index, columns = ['A','B','C'])
df

                   A         B         C
2020-01-01  0.847723 -0.702243  0.157861
2020-01-02 -1.871683  0.980887 -0.548752
2020-01-03  0.011154  0.655811  0.464245
2020-01-04  0.171371 -0.473166 -0.671124
2020-01-05  0.713385  0.023337  0.013750
2020-01-06  0.331903  1.682673  0.659231
2020-01-07 -0.551332 -0.943650 -0.684915
2020-01-08  0.829857  0.396512  1.975856

In [29]:
df.loc['2020-01-03']

A    0.011154
B    0.655811
C    0.464245
Name: 2020-01-03 00:00:00, dtype: float64

In [30]:
df.loc['2020-01-03':'2020-01-04']

                   A         B         C
2020-01-03  0.011154  0.655811  0.464245
2020-01-04  0.171371 -0.473166 -0.671124

In [31]:
football[football.wins > 10]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1
4  2012  Packers    11       5

In [34]:
football[(football.wins > 10) & (football.team == 'Packers')]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5